app/Controllers/Admin/Jabatan.php

    public function index()
    {
        $jabatanModel = new JabatanModel();
        $data = [
            'title' => 'Data Jabatan',
            'jabatan' => $jabatanModel->findAll()
---
SELECT *
FROM `jabatan`