app/Models/PresensiModel.php

    public function rekap_harian()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('presensi');
        $builder->select('presensi.*, pegawai.nama, lokasi_presensi.jam_masuk as jam_masuk_kantor');
        $builder->join('pegawai', 'pegawai.id = presensi.id_pegawai');
        $builder->join('lokasi_presensi', 'lokasi_presensi.id = pegawai.lokasi_presensi');
        $builder->where('tanggal_masuk', date('Y-m-d'));
        return $builder->get()->getResultArray();
---
SELECT `presensi`.*, `pegawai`.`nama`, `lokasi_presensi`.`jam_masuk` as `jam_masuk_kantor`
FROM `presensi`
JOIN `pegawai` ON `pegawai`.`id` = `presensi`.`id_pegawai`
JOIN `lokasi_presensi` ON `lokasi_presensi`.`id` = `pegawai`.`lokasi_presensi`
WHERE `tanggal_masuk` = '2024-12-24'

    public function rekap_harian_filter($filter_tanggal)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('presensi');
        $builder->select('presensi.*, pegawai.nama, lokasi_presensi.jam_masuk as jam_masuk_kantor');
        $builder->join('pegawai', 'pegawai.id = presensi.id_pegawai');
        $builder->join('lokasi_presensi', 'lokasi_presensi.id = pegawai.lokasi_presensi');
        $builder->where('tanggal_masuk', $filter_tanggal);
        return $builder->get()->getResultArray();
---
SELECT `presensi`.*, `pegawai`.`nama`, `lokasi_presensi`.`jam_masuk` as `jam_masuk_kantor`
FROM `presensi`
JOIN `pegawai` ON `pegawai`.`id` = `presensi`.`id_pegawai`
JOIN `lokasi_presensi` ON `lokasi_presensi`.`id` = `pegawai`.`lokasi_presensi`
WHERE `tanggal_masuk` = '2024-12-22'

    public function rekap_bulanan()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('presensi');
        $builder->select('presensi.*, pegawai.nama, lokasi_presensi.jam_masuk as jam_masuk_kantor');
        $builder->join('pegawai', 'pegawai.id = presensi.id_pegawai');
        $builder->join('lokasi_presensi', 'lokasi_presensi.id = pegawai.lokasi_presensi');
        $builder->where('MONTH(tanggal_masuk)', date('m'));
        $builder->where('YEAR(tanggal_masuk)', date('Y'));
        return $builder->get()->getResultArray();
---
SELECT `presensi`.*, `pegawai`.`nama`, `lokasi_presensi`.`jam_masuk` as `jam_masuk_kantor`
FROM `presensi`
JOIN `pegawai` ON `pegawai`.`id` = `presensi`.`id_pegawai`
JOIN `lokasi_presensi` ON `lokasi_presensi`.`id` = `pegawai`.`lokasi_presensi`
WHERE MONTH(tanggal_masuk) = '12'
AND YEAR(tanggal_masuk) = '2024'

    public function rekap_bulanan_filter($filter_bulan, $filter_tahun)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('presensi');
        $builder->select('presensi.*, pegawai.nama, lokasi_presensi.jam_masuk as jam_masuk_kantor');
        $builder->join('pegawai', 'pegawai.id = presensi.id_pegawai');
        $builder->join('lokasi_presensi', 'lokasi_presensi.id = pegawai.lokasi_presensi');
        $builder->where('MONTH(tanggal_masuk)', $filter_bulan);
        $builder->where('YEAR(tanggal_masuk)', $filter_tahun);
        return $builder->get()->getResultArray();
---
SELECT `presensi`.*, `pegawai`.`nama`, `lokasi_presensi`.`jam_masuk` as `jam_masuk_kantor`
FROM `presensi`
JOIN `pegawai` ON `pegawai`.`id` = `presensi`.`id_pegawai`
JOIN `lokasi_presensi` ON `lokasi_presensi`.`id` = `pegawai`.`lokasi_presensi`
WHERE MONTH(tanggal_masuk) = '12'
AND YEAR(tanggal_masuk) = '2030'